AccountingRegisters/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccountingRegister>
		<Properties>
			<Name>Хозрасчетный</Name>
			<Comment>(Регл)</Comment>
			<ChartOfAccounts>ChartOfAccounts.Хозрасчетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НалоговоеНазначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЖурнала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДополнительный</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИсходнойПроводки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвратТекущегоМесяца</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ЗаявкиНаРасходованиеСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаявкиНаРасходованиеСредств</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаВзаиморасчетов</Name>
					<Comment>Сумма в валюте взаиморасчетов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте упр. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма к оплате</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаОС</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияУслугПоПереработке</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеИзПереработки</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслугВНТТ</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежныйОрдерСписаниеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.АктОбОказанииПроизводственныхУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.Сервис</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолгаПоВозвратнойТаре</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеДопРасходов</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ГТДИмпорт</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежныйОрдерПоступлениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщикуИзНТТ</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаявкаНаРасходование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРасходованиеСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРаспределенияПоПроектам</v8:Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРасчетовСКонтрагентом</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаОС</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияУслугПоПереработке</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеИзПереработки</v8:Type>
						<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслугВНТТ</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежныйОрдерСписаниеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.АктОбОказанииПроизводственныхУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолгаПоВозвратнойТаре</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеДопРасходов</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ОплатаОтПокупателяПлатежнойКартой</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежныйОрдерПоступлениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщикуИзНТТ</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/СтатусыЗаявокНаРасходованиеДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>СтатусыЗаявокНаРасходованиеДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеСогласована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КОплате</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаСогласовании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастичноОплачена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплачена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыОтправкиДокументовПоПочте.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>СтатусыОтправкиДокументовПоПочте</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОтправленПоПочте</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КОтправке</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОперацийППИсходящее.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыОперацийППИсходящее</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоставщику</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратДенежныхСредствПокупателю</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоКредитамИЗаймамСКонтрагентами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасчетыСКонтрагентами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеНалога</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводНаДругойСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочееСписаниеБезналичныхДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеЗП</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПокупкаПродажаВалюты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеДенежныхСредствПодотчетнику</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеЗПСотруднику</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/а3б_ДляПодписокНаСобытия/Ext/Module.bsl
///////////////////////////////////////////////
// Д О К У М Е Н Т Ы

//Документ_ОбработкаПроведения

Процедура Документ_ОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	
	Если Найти("
		|ИНАГРО_ВедомостьВыплатПайщикам,
		|ОтчетОРозничныхПродажах,
		|"
		,Источник.Метаданные().Имя+",") > 0 Тогда 
		
		Выполнить(Источник.Метаданные().Имя+"_ОбработкаПроведения(Источник, Отказ, РежимПроведения);");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ИНАГРО_ВедомостьВыплатПайщикам_ОбработкаПроведения(Источник, Отказ, РежимПроведения)
	
КонецПроцедуры	

Процедура ОтчетОРозничныхПродажах_ОбработкаПроведения(Источник, Отказ, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВложенныйЗапрос.Ссылка,
		|	ВложенныйЗапрос.Номенклатура,
		|	ВложенныйЗапрос.Сумма,
		|	ВложенныйЗапрос.СуммаНДС,
		|	ВложенныйЗапрос1.СуммаОборотДт,
		|	ВложенныйЗапрос1.СуммаОборотКт,
		|	ВложенныйЗапрос1.КоличествоОборотКт,
		|	ВложенныйЗапрос.Количество,
		|	ВложенныйЗапрос.СтавкаНДС
		|ИЗ
		|	(ВЫБРАТЬ
		|		ОтчетОРозничныхПродажахТовары.Ссылка КАК Ссылка,
		|		ОтчетОРозничныхПродажахТовары.Номенклатура КАК Номенклатура,
		|		СУММА(ОтчетОРозничныхПродажахТовары.Количество * ОтчетОРозничныхПродажахТовары.Коэффициент) КАК Количество,
		|		СУММА(ОтчетОРозничныхПродажахТовары.Сумма) КАК Сумма,
		|		СУММА(ОтчетОРозничныхПродажахТовары.СуммаНДС) КАК СуммаНДС,
		|		ОтчетОРозничныхПродажахТовары.СчетУчетаБУ КАК СчетУчетаБУ,
		|		ОтчетОРозничныхПродажахТовары.СтавкаНДС КАК СтавкаНДС
		|	ИЗ
		|		Документ.ОтчетОРозничныхПродажах.Товары КАК ОтчетОРозничныхПродажахТовары
		|	ГДЕ
		|		ОтчетОРозничныхПродажахТовары.Ссылка = &Ссылка
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ОтчетОРозничныхПродажахТовары.Номенклатура,
		|		ОтчетОРозничныхПродажахТовары.Ссылка,
		|		ОтчетОРозничныхПродажахТовары.СчетУчетаБУ,
		|		ОтчетОРозничныхПродажахТовары.СтавкаНДС) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ХозрасчетныйОбороты.Счет КАК Счет,
		|			ХозрасчетныйОбороты.Субконто1 КАК Субконто1,
		|			СУММА(ХозрасчетныйОбороты.СуммаОборотДт) КАК СуммаОборотДт,
		|			СУММА(ХозрасчетныйОбороты.СуммаОборотКт) КАК СуммаОборотКт,
		|			ХозрасчетныйОбороты.КорСчет КАК КорСчет,
		|			ХозрасчетныйОбороты.КорСубконто1 КАК КорСубконто1,
		|			ХозрасчетныйОбороты.Регистратор КАК Регистратор,
		|			ХозрасчетныйОбороты.КоличествоОборотКт КАК КоличествоОборотКт
		|		ИЗ
		|			РегистрБухгалтерии.Хозрасчетный.Обороты(, , Регистратор, , , , , ) КАК ХозрасчетныйОбороты
		|		ГДЕ
		|			ХозрасчетныйОбороты.Регистратор = &Ссылка
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ХозрасчетныйОбороты.КорСчет,
		|			ХозрасчетныйОбороты.Счет,
		|			ХозрасчетныйОбороты.КорСубконто1,
		|			ХозрасчетныйОбороты.Субконто1,
		|			ХозрасчетныйОбороты.Регистратор,
		|			ХозрасчетныйОбороты.КоличествоОборотКт) КАК ВложенныйЗапрос1
		|		ПО ВложенныйЗапрос.Ссылка = ВложенныйЗапрос1.Регистратор
		|			И ВложенныйЗапрос.Номенклатура = ВложенныйЗапрос1.Субконто1
		|			И ВложенныйЗапрос.СчетУчетаБУ = ВложенныйЗапрос1.Счет";
	
	Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Движения = Источник.Движения;
	
	Контрагент = Источник.КассаККМ.Контрагент;

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Движение = Движения.ИНАГРО_РеализацияОрганизаций.Добавить();
		Движение.Период = Источник.Дата;
		Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
		Движение.Организация = Источник.Организация;
		Движение.Склад = Источник.Склад;
		Движение.СтавкаНДС = ВыборкаДетальныеЗаписи.СтавкаНДС;
		Движение.Контрагент = Контрагент;
		Движение.Количество = ВыборкаДетальныеЗаписи.КоличествоОборотКт;
		Движение.Стоимость = ВыборкаДетальныеЗаписи.Сумма;
		Движение.СуммаНДС = ВыборкаДетальныеЗаписи.СуммаНДС/ВыборкаДетальныеЗаписи.Количество*ВыборкаДетальныеЗаписи.КоличествоОборотКт;
		Движение.СебестоимостьСумма = ВыборкаДетальныеЗаписи.СуммаОборотКт;
		Движение.СебестоимостьЦена = ?(ВыборкаДетальныеЗаписи.КоличествоОборотКт = 0 Или ВыборкаДетальныеЗаписи.СуммаОборотКт = 0,0,ВыборкаДетальныеЗаписи.СуммаОборотКт/ВыборкаДетальныеЗаписи.КоличествоОборотКт);		
	КонецЦикла;

	
КонецПроцедуры	


//Документ_ОбработкаЗаполнения

Процедура Документ_ОбработкаЗаполнения(Источник, Основание, Отказ) Экспорт
	
	
	Если Найти("
		|ИНАГРО_ВедомостьВыплатПайщикам,
		|"
		,Источник.Метаданные().Имя+",") > 0 Тогда 
		
		Выполнить(Источник.Метаданные().Имя+"_ОбработкаЗаполнения(Источник, Основание, Отказ);");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ИНАГРО_ВедомостьВыплатПайщикам_ОбработкаЗаполнения(Источник, Основание, Отказ)
	Источник.ДокументОснование = Основание;
	Возврат;
КонецПроцедуры	

//<--- a3b ЮД 23.01.2020 15:48:46 
Функция ПолучитьПредопределенныйЭлемент(Имя) Экспорт
	
	Результат = Справочники.ПредопределенныеЭлементы.НайтиПоНаименованию(Имя);
	Если (Результат = Неопределено) или (Результат = Справочники.ПредопределенныеЭлементы.ПустаяСсылка()) Тогда
		Сообщить(НСтр("ru='Предопределенный элемент ';uk='Напередвизначений елемент '")+Имя+НСтр("ru=' не найден!';uk=' не знайдено!'"));
		Возврат Неопределено;
	Иначе
		Возврат Результат.Значение;
	КонецЕсли;
	
КонецФункции
//---> a3b ЮД 23.01.2020 15:50:19 

//a3b-admin.02.07.2020 15:44:20 +++ 
//возвращает результат запроса к участкам договора
Функция РезультатЗапросаУчасткиИзДоговора(ДоговорКонтрагента) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДоговорыКонтрагентовСписокУчастков.Участок
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов.СписокУчастков КАК ДоговорыКонтрагентовСписокУчастков
		|ГДЕ
		|	ДоговорыКонтрагентовСписокУчастков.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ДоговорыКонтрагентовСписокУчастков.Участок";
	
	Запрос.УстановитьПараметр("Ссылка", ДоговорКонтрагента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса; 
КонецФункции
//a3b-admin.02.07.2020 15:44:23 --- 

//a3b-admin.03.07.2020 15:59:45 +++ 
//открывает форму выбора участков с отбором по текущему договору
Процедура ВыборУчастка(ТекущаяСтрока, Элемент) Экспорт
	
	ТЗУчастки = РезультатЗапросаУчасткиИзДоговора(ТекущаяСтрока.ДоговорКонтрагента).Выгрузить();
	
	Список = Новый СписокЗначений;
	Список.ЗагрузитьЗначения(ТЗУчастки.ВыгрузитьКолонку("Участок"));
	
	ФормаВыбора = Справочники.ИНАГРО_Участки.ПолучитьФормуВыбора(,Элемент);
	ФормаВыбора.РежимВыбора = Истина;
	ФормаВыбора.НачальноеЗначениеВыбора = Элемент.Значение;
	ФормаВыбора.ЭлементыФормы.СправочникСписок.ИерархическийПросмотр = Ложь;
	
	ФормаВыбора.Отбор.Ссылка.Использование = Истина;
	ФормаВыбора.Отбор.Ссылка.ВидСравнения = ВидСравнения.ВСписке;
	ФормаВыбора.Отбор.Ссылка.Значение = Список;
	
	ФормаВыбора.Открыть();
КонецПроцедуры
//a3b-admin.03.07.2020 15:59:49 --- 

//<+++ a3b ЮД 25.08.2020 15:45:43 
Процедура ЗагрузкаКурсовВалют() Экспорт
	ЗагрузитьКурсыПоНастройкам();
КонецПроцедуры

// Производит загрузку курсов и кратностей валют с сайта finance.ua по ежедневным настройкам
//
Процедура ЗагрузитьКурсыПоНастройкам() 
	
	ЗначениеКонстанты = Константы.НастройкиЗагрузкиКурсовВалют.Получить();
	Настройки 		  = ЗначениеКонстанты.Получить();
	//<+++ a3b ЮД 25.08.2020 16:31:18 
	СписокВалют = Новый ТаблицаЗначений;
	СписокВалют.Колонки.Добавить("Валюта");
	СписокВалют.Колонки.Добавить("Пометка");
	ИмяФайла = "Curses.html"; 
	ОшибкаКодаСервера = Ложь;
	//---> a3b ЮД 25.08.2020 16:31:59 
	
	НачДата = ТекущаяДата() - 10*24*60*60; //<+++ a3b ЮД 03.08.2020 15:57:53 
	КонДата = ТекущаяДата();

	//ЗапомнитьИмяИПароль = Настройки.ЗапомнитьИмяИПароль;

	//Если ЗапомнитьИмяИПароль Тогда
	//	ИмяПользователя 	= Настройки.ИмяПользователя;
	//	ПарольПользователя 	= Настройки.ПарольПользователя;
	//КонецЕсли;
	//
	//КодДоступа = Настройки.КодДоступа;
	
	Валюты = Настройки.СписокВалют;
	СписокВалют.Очистить();
	Для сч=0 По Валюты.Количество()-1 Цикл
		Вал = СписокВалют.Добавить();
		Вал.Валюта = Валюты[сч];
		Вал.Пометка = Истина;
	КонецЦикла;
	
	//+Никитин
		
	РегистрКурсыВалют = РегистрыСведений.КурсыВалют;
	ЗаписьКурсовВалют = РегистрКурсыВалют.СоздатьМенеджерЗаписи();

	Текст = Новый ТекстовыйДокумент();


	ВремКаталог = КаталогВременныхФайлов() + "tempKurs";
	СоздатьКаталог(ВремКаталог);
	УдалитьФайлы(ВремКаталог,"*.*");
	
	Для каждого СтрокаСпВалют из СписокВалют Цикл
		
		Если НЕ СтрокаСпВалют.Пометка Тогда
			Продолжить;	
		КонецЕсли;
		
		ТекВалюта = СтрокаСпВалют.Валюта;
		Стр = "";
		
				ИмяВходящегоФайла = "" + ВремКаталог + "\" + ИмяФайла;
		
		ТекДат = НачалоДня(НачДата);
		Пока ТекДат <= НачалоДня(КонДата) Цикл 
			Если ПолучитьКурсНацБанка(ТекВалюта,ТекДат,ИмяВходящегоФайла) <> Истина Тогда
				Если ОшибкаКодаСервера Тогда
					Прервать;
				КОнецЕсли;
				ТекДат = ТекДат+86400;//<+++ a3b ЮД 03.08.2020 15:17:53  ТекДат = ТекДат+1
				Продолжить;
			КонецЕсли; 

			ВходящийФайл = Новый Файл(ИмяВходящегоФайла);
			Если НЕ ВходящийФайл.Существует() Тогда
				ТекДат = ТекДат+86400;  //<+++ a3b ЮД 03.08.2020 15:17:28 ТекДат = ТекДат+1
				Продолжить;
			КонецЕсли;	

			Текст.Прочитать(ИмяВходящегоФайла,КодировкаТекста.UTF8);
			
			КолСтрок = Текст.КоличествоСтрок();
			Для Инд = 1 По КолСтрок Цикл
				НадписьВалютыФормы = СокрЛП(ТекВалюта.Наименование);

				ИндикаторФормы = Инд/КолСтрок * 100;
					
				Стр = Текст.ПолучитьСтроку(Инд);
				//Если (Стр = "") ИЛИ (Найти(Стр,Символы.Таб) = 0) Тогда
				Если Найти(стр,"rate")=0 тогда
				   Продолжить;
				КонецЕсли;
								
				текстДата = """exchangedate"":""";    
				ДатаКурса = Сред(стр,Найти(Стр,текстДата)+СтрДлина(текстДата),10);    
				ДатаКурса = Дата(ДатаКурса+" 00:00:00") ;
				
				текстКурс = """rate"":";    
				НачСимвол = Найти(Стр,текстКурс)+СтрДлина(текстКурс);
				мКурс = Сред(стр,НачСимвол,Найти(Стр,"""cc""")-1-НачСимвол);
				
				Если СтрДлина(мКурс) > 7 тогда
					Кратность = 100;
					Курс      = Число(мКурс)*100;
				иначе
					Кратность = 1;
					Курс      = Число(мКурс);
				КонецЕсли;

				Если ДатаКурса > КонДата Тогда
				   Прервать;
				КонецЕсли;

				Если ДатаКурса < НачДата Тогда 
				   Продолжить;
				КонецЕсли;

	            ЗаписьКурсовВалют.Валюта = ТекВалюта;
				ЗаписьКурсовВалют.Период = ДатаКурса;
				ЗаписьКурсовВалют.Прочитать();
				ЗаписьКурсовВалют.Валюта    = ТекВалюта;
				ЗаписьКурсовВалют.Период    = ДатаКурса;
				ЗаписьКурсовВалют.Курс      = Курс;
				ЗаписьКурсовВалют.Кратность = Кратность;
				ЗаписьКурсовВалют.Записать();
			КонецЦикла;
			
			ТекДат = ТекДат+86400;//Добавим 1 День
		КонецЦикла;
		
	КонецЦикла;	
	
	УдалитьФайлы(ВремКаталог,"*.*");


КонецПроцедуры // ЗагрузитьКурсыПоНастройкам()


функция ПолучитьКурсНацБанка(мВалюта,мДата,ИмяВходящегоФайла) 

	Соединение = Новый HTTPСоединение("bank.gov.ua",443,,,,,Новый ЗащищенноеСоединениеOpenSSL());

	ВалютаФормат = мВалюта.Наименование;
	ДатаФормат = Формат(мДата, "ДФ=yyyyMMdd"); 
	Запрос = Новый HTTPЗапрос("/NBUStatService/v1/statdirectory/exchange?valcode="+ВалютаФормат+"&date="+ДатаФормат+"&json"); 

	Заголовки = Новый Соответствие;
	Заголовки.Вставить("User-Agent", "Mozilla/5.0 (X11; Linux i686; rv:2.0.1) Gecko/20100101 Firefox/4.0.1");
	Заголовки.Вставить("Cookie", "id=1");

	Запрос.Заголовки = Заголовки;
	
	
	Попытка
		Ответ = Соединение.Получить(Запрос,ИмяВходящегоФайла);
		Возврат Истина;
	Исключение
		
	КонецПопытки;

Конецфункции



Процедура ДокументПередЗапиисьюПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если Найти("
		|НалоговаяНакладная,
		|"
		,Источник.Метаданные().Имя+",") > 0 Тогда 
		
		Выполнить(Источник.Метаданные().Имя+"_ПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения);");
		
	КонецЕсли;
	
КонецПроцедуры


Процедура НалоговаяНакладная_ПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения)
	если ложь тогда  Источник = Документы.НалоговаяНакладная.СоздатьДокумент(); КонецЕсли;
	
	Если не ЗначениеЗаполнено(Источник.КтоВыписалНалоговуюНакладную) Тогда 
		отвЛ = ФормированиеПечатныхФорм.ОтветственныеЛица(Источник.Организация,Источник.Дата);
		Если ЗначениеЗаполнено(отвЛ.ГлавныйБухгалтер) Тогда 
			Источник.КтоВыписалНалоговуюНакладную = отвЛ.ГлавныйБухгалтер;
		иначе	
			Источник.КтоВыписалНалоговуюНакладную = отвЛ.Руководитель;
		КонецЕсли;	
		
	КонецЕсли;	
КонецПроцедуры	

Процедура анУстановитьСтатусОплаченоОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	Попытка
		
		
		
		Если ТипЗнч(Источник) = тип("ДокументОбъект.ПлатежноеПоручениеИсходящее") Тогда 
			
			Если Источник.РасшифровкаПлатежа.Количество() Тогда 
				Заявка = Источник.РасшифровкаПлатежа[0].ДокументПланированияПлатежа;
			Иначе
				Заявка = Документы.ЗаявкаНаРасходованиеСредств.ПустаяСсылка();
			КонецЕсли;
			
			если ЗначениеЗаполнено(Источник.ДокументОснование) или ЗначениеЗаполнено(Заявка) Тогда 
				Если ТипЗнч(Источник.ДокументОснование) = тип("ДокументСсылка.ЗаявкаНаРасходованиеСредств") 
					или  ТипЗнч(Заявка) = тип("ДокументСсылка.ЗаявкаНаРасходованиеСредств") Тогда  
					Если ЗначениеЗаполнено(Источник.ДокументОснование) Тогда   
						Если ПолучитьОстатокПоЗаявке(Источник.ДокументОснование.ссылка)=0 Тогда 
							ЗаявкаОбъект = Источник.ДокументОснование.ПолучитьОбъект();    
							ЗаявкаОбъект.Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Оплачена;
							ЗаявкаОбъект.Записать();
						ИначеЕсли ПолучитьОстатокПоЗаявке(Источник.ДокументОснование.ссылка)=Источник.СуммаДокумента Тогда 
							
							ЗаявкаОбъект = Источник.ДокументОснование.ПолучитьОбъект();    
							ЗаявкаОбъект.Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Оплачена;
							ЗаявкаОбъект.Записать();  
							
						Иначе 
							ЗаявкаОбъект = Источник.ДокументОснование.ПолучитьОбъект();    
							ЗаявкаОбъект.Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.ЧастичноОплачена;
							ЗаявкаОбъект.Записать();  
						КонецЕсли;	
						
					ИначеЕсли ЗначениеЗаполнено(Заявка) Тогда 
						Если ПолучитьОстатокПоЗаявке(Заявка)=0 Тогда 
							ЗаявкаОбъект = Заявка.ПолучитьОбъект();    
							ЗаявкаОбъект.Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Оплачена;
							ЗаявкаОбъект.Записать();
						ИначеЕсли ПолучитьОстатокПоЗаявке(Заявка)=Источник.СуммаДокумента Тогда 
							
							ЗаявкаОбъект = Заявка.ПолучитьОбъект();    
							ЗаявкаОбъект.Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Оплачена;
							ЗаявкаОбъект.Записать();  
							
						Иначе 
							ЗаявкаОбъект = Заявка.ПолучитьОбъект();    
							ЗаявкаОбъект.Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.ЧастичноОплачена;
							ЗаявкаОбъект.Записать();  
						КонецЕсли;	
					КонецЕсли;
					
					//Дандали В. 27.08.2025 +
					Если ЗаявкаОбъект.Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Оплачена Тогда
						
						СтатусОтправкиПоПочте = А_ОбщегоНазначенияСервер.ПолучитьСтатусОтправкиДокумента(ЗаявкаОбъект.Ссылка);

						Если СтатусОтправкиПоПочте <> Перечисления.СтатусыОтправкиДокументовПоПочте.ОтправленПоПочте 
							И СтатусОтправкиПоПочте <> Перечисления.СтатусыОтправкиДокументовПоПочте.КОтправке Тогда
							А_ОбщегоНазначенияСервер.ЗаписатьДокументВОчередьНаОтправку(ЗаявкаОбъект.Ссылка);
						ИначеЕсли СтатусОтправкиПоПочте = Перечисления.СтатусыОтправкиДокументовПоПочте.ОтправленПоПочте 
							И А_ОбщегоНазначенияСервер.ПолучитьСтатусОтправкиДокумента(ЗаявкаОбъект.Ссылка) = "" Тогда
							А_ОбщегоНазначенияСервер.УстановитьСтатусОтправкиПоПочте(ЗаявкаОбъект.Ссылка, Перечисления.СтатусыОтправкиДокументовПоПочте.ОтправленПоПочте);
						КонецЕсли;
						
					КонецЕсли;
					//Дандали В. 27.08.2025 -
					
					
				КонецЕсли;
				КонецЕсли;
				ИначеЕсли ТипЗнч(Источник) = тип("ДокументОбъект.УпрРасходныйКассовыйОрдер") Тогда
					если ЗначениеЗаполнено(Источник.ДокументОснование.ссылка) Тогда 
						Если ПолучитьОстатокПоЗаявке(Источник.ДокументОснование.ссылка)=0 Тогда 
							ЗаявкаОбъект = Источник.ДокументОснование.ПолучитьОбъект();    
							ЗаявкаОбъект.Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Оплачена;
							ЗаявкаОбъект.Записать();
						ИначеЕсли ПолучитьОстатокПоЗаявке(Источник.ДокументОснование.ссылка)=Источник.СуммаДокумента Тогда 
							
							ЗаявкаОбъект = Источник.ДокументОснование.ПолучитьОбъект();    
							ЗаявкаОбъект.Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Оплачена;
							ЗаявкаОбъект.Записать();  
							
						Иначе 
							ЗаявкаОбъект = Источник.ДокументОснование.ПолучитьОбъект();    
							ЗаявкаОбъект.Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.ЧастичноОплачена;
							ЗаявкаОбъект.Записать();  
						КонецЕсли;		
						
					КонецЕсли;	
				КонецЕсли;
			Исключение
			КонецПопытки;
		КонецПроцедуры

Процедура анУдалитьСтатусОплаченоОбработкаУдаленияПроведения(Источник, Отказ) Экспорт
	//Дандали В. 04.12.2024 +
	Попытка
		Если ТипЗнч(Источник) = тип("ДокументОбъект.ПлатежноеПоручениеИсходящее") Тогда 
			Если не Источник.ВидОперации = Перечисления.ВидыОперацийППИсходящее.ПеречислениеЗП тогда 
				если ЗначениеЗаполнено(Источник.ДокументОснование) и ТипЗнч(Источник.ДокументОснование)=тип("ДокументСсылка.ЗаявкаНаРасходованиеСредств") Тогда 
					Если ПолучитьОстатокПоЗаявке(Источник.ДокументОснование.ссылка)=0 Тогда 
						ЗаявкаОбъект = Источник.ДокументОснование.ПолучитьОбъект();    
						ЗаявкаОбъект.Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Оплачена;
						ЗаявкаОбъект.Записать();
					ИначеЕсли ПолучитьОстатокПоЗаявке(Источник.ДокументОснование.ссылка)=Источник.ДокументОснование.СуммаДокумента Тогда 
						
						ЗаявкаОбъект = Источник.ДокументОснование.ПолучитьОбъект();    
						ЗаявкаОбъект.Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.КОплате;
						ЗаявкаОбъект.Записать();  
						
					Иначе 
						ЗаявкаОбъект = Источник.ДокументОснование.ПолучитьОбъект();    
						ЗаявкаОбъект.Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.ЧастичноОплачена;
						ЗаявкаОбъект.Записать();  
					КонецЕсли;	
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли ТипЗнч(Источник) = тип("ДокументОбъект.УпрРасходныйКассовыйОрдер") Тогда
			если ЗначениеЗаполнено(Источник.ДокументОснование) Тогда 
				Если ПолучитьОстатокПоЗаявке(Источник.ДокументОснование.ссылка)=0 Тогда 
					ЗаявкаОбъект = Источник.ДокументОснование.ПолучитьОбъект();    
					ЗаявкаОбъект.Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Оплачена;
					ЗаявкаОбъект.Записать();
				ИначеЕсли ПолучитьОстатокПоЗаявке(Источник.ДокументОснование.ссылка)=Источник.ДокументОснование.СуммаДокумента Тогда 
					
					ЗаявкаОбъект = Источник.ДокументОснование.ПолучитьОбъект();    
					ЗаявкаОбъект.Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.КОплате;
					ЗаявкаОбъект.Записать();  
					
				Иначе 
					ЗаявкаОбъект = Источник.ДокументОснование.ПолучитьОбъект();    
					ЗаявкаОбъект.Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.ЧастичноОплачена;
					ЗаявкаОбъект.Записать();  
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;
	Исключение
	КонецПопытки;
	//Дандали В. 04.12.2024 -

КонецПроцедуры

Функция ПолучитьОстатокПоЗаявке(Заявка)
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДенежныеСредстваКВыплатеОстатки.СуммаОстаток
	               |ИЗ
	               |	РегистрНакопления.ЗаявкиНаРасходованиеСредств.Остатки КАК ДенежныеСредстваКВыплатеОстатки
	               |ГДЕ
	               |	ДенежныеСредстваКВыплатеОстатки.ЗаявкаНаРасходование = &ЗаявкаНаРасходованиеДенежныхСредств";
	Запрос.УстановитьПараметр("ЗаявкаНаРасходованиеДенежныхСредств",Заявка);
	
	РезультатЗапрос = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапрос.Количество() Тогда 
		Возврат РезультатЗапрос[0].СуммаОстаток;
		
	КонецЕсли;
	Возврат 0;	
КонецФункции


//---> a3b ЮД 25.08.2020 15:48:47
